# CircuitPhaseParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CircuitPhaseParam Property
ParameterTypeId Class See Also
---
"Phase Label"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CircuitPhaseParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CircuitPhaseParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CircuitPhaseParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace